documentation/cxsetup/cxsetup_1.0.org
#+title: CXSetup Official Documentation
#+description: The official documentation for the CX Setup language.
#+author: Matthew (MF366)

#+options: toc:nil

#+TOC: headlines 2

* About the Documentation
The page/document you are currently looking at is the *Official Documentation for the CX Setup scripting language*. It was made primarily by Matthew ([[https://mf366-coding.github.io][MF366]]) using ~Org Mode~ on ~Emacs~, later exported to ~HTML~.

** Licensing (Docs)
This documentation is licensed under the [[https://www.gnu.org/licenses/fdl-1.3.txt][*GNU Free Documentation License (GFDL)*]]. Therefore, all edits, reuses and whatnot of this documentation (valid for both ~Org~ and ~HTML~ versions of the docs) must comply with GFDL's terms and conditions.

** Contributing
If you wish to contribute to the documentation, I'd really appreciate it. However, there are some rules and guidelines you must follow:
- *KISS: Keep It Simple, Stupid.* Make sure your changes do not affect the simplicity and readability of the documentation in a negative way.
- *If it ain’t broken, don’t redesign it.* Do not propose changes to how the UI should look, as the current combination of HTML and CSS aims for simplicity, due to the fact it's very objective.
- *Editing the HTML export is like painting a screenshot — impressive, but pointless.* Make /Pull Requests/ for the ~Org~ files, not the ~HTML~ ones.
- *Fixing typos is noble; flooding PRs with them is chaos.* Typo squatting is perfectly fine and helpful, but don't make too many /Pull Requests/ to fix typos in a row, as it causes unnecessary spam. The best alternative is to "bundle" several typo fixes in one PR.
- *There are no stupid questions — only unanswered ones (and I try to avoid those).* If you have any questions, don't hesitate to ask, as I try to reply to all. You can use the following e-mail: [[mailto:real_mf366@yahoo.com][~real_mf366@yahoo.com~]].

If those rules did not scare you away, the GitHub repository is [[https://github.com/MF366-Coding/mf366-coding.github.io][right here]]. Thanks ahead for your contributions.

* Comments
Just like in any other scripting language, CXSetup allows comments, albeit only single-line ones.

#+begin_src
// This is a comment
// This is another comment
# This is a syntax error
<!-- So is this -->
// Comments must start with //
// They also last until the end of the line, semicolon or not
#+end_src

* Data Types
Keywords will be a matter of discussion later on, but they require arguments, which must be passed programatically. Each keyword argument must conform to a supported data type.

The available data types are:
- *Bytes* (rarely used - cannot be represented without a cache grab)
- *String* (text data - ="Hello, World"=)
- *Character* (single character - ="a"=)
- *Integer* (whole number, can be positive or negative - =5=)
- *Float* (decimal number - =3.14=)

* Keywords
In CXSetup, there are no functions, classes, or even variables. Scripts are built entirely from keywords — each acting like a mini-command that does one specific job.

Here is an example of keywords in use:
#+begin_src
// COUT outputs something to the screen with no newline
COUT ?? "Hello, World!";

// Let's try doing a neofetch
RUN ?? "neofetch";
#+end_src

Below are the available keywords in CXSetup.

------------------------------------------------------------

** =COUT=
Quite possibly, one of the simplest keywords. Outputs something to the screen without a newline.

| Summary                 | Arguments                                                     | Returns | Exceptions | Example                  |
|-------------------------+---------------------------------------------------------------+---------+------------+--------------------------|
| Outputs text to ~stdout~. | Accepts any amount of string arguments as the text to output. | None    | None       | =COUT ?? "Hello, World!";= |

** =ENDL= and =ENDL2=
These ones are also extremely simple: all they do is output new lines to the screen. =ENDL= outputs 1 newline, while =ENDL2= outputs 2.

| Summary                                             | Arguments                              | Returns | Exceptions | Example      |
|-----------------------------------------------------+----------------------------------------+---------+------------+--------------|
| Outputs newlines to ~stdout~ (1 if =ENDL=, 2 if =ENDL2=). | Does not accept or need any arguments. | None    | None       | =ENDL; ENDL2;= |

