documentation/cxsetup/cxsetup_1.0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-14 seg 19:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CXSetup Official Documentation</title>
<meta name="author" content="Matthew (MF366)" />
<meta name="description" content="The official documentation for the CX Setup language." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CXSetup Official Documentation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3b1f4fd">1. About the Documentation</a>
<ul>
<li><a href="#org5c740e7">1.1. Licensing (Docs)</a></li>
<li><a href="#org944fc5b">1.2. Contributing</a></li>
</ul>
</li>
<li><a href="#org7e2b531">2. Comments</a></li>
<li><a href="#org3f60627">3. Data Types</a></li>
<li><a href="#orgd71e205">4. Keywords</a>
<ul>
<li><a href="#org9a10935">4.1. <code>COUT</code></a></li>
<li><a href="#org10bd267">4.2. <code>ENDL</code> and <code>ENDL2</code></a></li>
<li><a href="#orga9bafa2">4.3. <code>STYLE</code>, <code>FORE</code> and <code>BACK</code></a></li>
<li><a href="#org2f0709f">4.4. <code>TERMINATE</code></a></li>
<li><a href="#org3c4e4c4">4.5. <code>CIN</code> (0 arguments overload)</a></li>
<li><a href="#org74254f0">4.6. <code>CIN</code> (1 argument overload)</a></li>
<li><a href="#org44bd558">4.7. <code>RUN</code></a></li>
<li><a href="#orgc7206c8">4.8. <code>CIN</code> (2 arguments overload)</a></li>
<li><a href="#orgd9aa06e">4.9. <code>GETPASS</code></a></li>
<li><a href="#orga57db79">4.10. <code>SAFECIN</code> (1 argument overload)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3b1f4fd" class="outline-2">
<h2 id="org3b1f4fd"><span class="section-number-2">1.</span> About the Documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
The page/document you are currently looking at is the <b>Official Documentation for the CX Setup scripting language</b>. It was made primarily by Matthew (<a href="https://mf366-coding.github.io">MF366</a>) using <code>Org Mode</code> on <code>Emacs</code>, later exported to <code>HTML</code>.
</p>
</div>
<div id="outline-container-org5c740e7" class="outline-3">
<h3 id="org5c740e7"><span class="section-number-3">1.1.</span> Licensing (Docs)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This documentation is licensed under the <a href="https://www.gnu.org/licenses/fdl-1.3.txt"><b>GNU Free Documentation License (GFDL)</b></a>. Therefore, all edits, reuses and whatnot of this documentation (valid for both <code>Org</code> and <code>HTML</code> versions of the docs) must comply with GFDL&rsquo;s terms and conditions.
</p>
</div>
</div>
<div id="outline-container-org944fc5b" class="outline-3">
<h3 id="org944fc5b"><span class="section-number-3">1.2.</span> Contributing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
If you wish to contribute to the documentation, I&rsquo;d really appreciate it. However, there are some rules and guidelines you must follow:
</p>
<ul class="org-ul">
<li><b>KISS: Keep It Simple, Stupid.</b> Make sure your changes do not affect the simplicity and readability of the documentation in a negative way.</li>
<li><b>If it ain’t broken, don’t redesign it.</b> Do not propose changes to how the UI should look, as the current combination of HTML and CSS aims for simplicity, due to the fact it&rsquo;s very objective.</li>
<li><b>Editing the HTML export is like painting a screenshot — impressive, but pointless.</b> Make <i>Pull Requests</i> for the <code>Org</code> files, not the <code>HTML</code> ones.</li>
<li><b>Fixing typos is noble; flooding PRs with them is chaos.</b> Typo squatting is perfectly fine and helpful, but don&rsquo;t make too many <i>Pull Requests</i> to fix typos in a row, as it causes unnecessary spam. The best alternative is to &ldquo;bundle&rdquo; several typo fixes in one PR.</li>
<li><b>There are no stupid questions — only unanswered ones (and I try to avoid those).</b> If you have any questions, don&rsquo;t hesitate to ask, as I try to reply to all. You can use the following e-mail: <a href="mailto:real_mf366@yahoo.com"><code>real_mf366@yahoo.com</code></a>.</li>
</ul>

<p>
If those rules did not scare you away, the GitHub repository is <a href="https://github.com/MF366-Coding/mf366-coding.github.io">right here</a>. Thanks ahead for your contributions.
</p>
</div>
</div>
</div>
<div id="outline-container-org7e2b531" class="outline-2">
<h2 id="org7e2b531"><span class="section-number-2">2.</span> Comments</h2>
<div class="outline-text-2" id="text-2">
<p>
Just like in any other scripting language, CXSetup allows comments, albeit only single-line ones.
</p>

<div class="org-src-container">
<pre class="src src-nil">// This is a comment
// This is another comment
# This is a syntax error
&lt;!-- So is this --&gt;
// Comments must start with //
// They also last until the end of the line, semicolon or not
</pre>
</div>
</div>
</div>
<div id="outline-container-org3f60627" class="outline-2">
<h2 id="org3f60627"><span class="section-number-2">3.</span> Data Types</h2>
<div class="outline-text-2" id="text-3">
<p>
Keywords will be a matter of discussion later on, but they require arguments, which must be passed programatically. Each keyword argument must conform to a supported data type.
</p>

<p>
The available data types are:
</p>
<ul class="org-ul">
<li><b>Bytes</b> (rarely used - cannot be represented without a cache grab)</li>
<li><b>String</b> (text data - <code>"Hello, World"</code>)</li>
<li><b>Character</b> (single character - <code>"a"</code>)</li>
<li><b>Integer</b> (whole number, can be positive or negative - <code>5</code>)</li>
<li><b>Float</b> (decimal number - <code>3.14</code>)</li>
</ul>
</div>
</div>
<div id="outline-container-orgd71e205" class="outline-2">
<h2 id="orgd71e205"><span class="section-number-2">4.</span> Keywords</h2>
<div class="outline-text-2" id="text-4">
<p>
In CXSetup, there are no functions, classes, or even variables. Scripts are built entirely from keywords — each acting like a mini-command that does one specific job.
</p>

<p>
Here is an example of keywords in use:
</p>
<div class="org-src-container">
<pre class="src src-nil">// COUT outputs something to the screen with no newline
COUT ?? "Hello, World!";

// Let's try doing a neofetch
RUN ?? "neofetch";
</pre>
</div>

<p>
Below are the available keywords in CXSetup.
</p>

<hr />
</div>
<div id="outline-container-org9a10935" class="outline-3">
<h3 id="org9a10935"><span class="section-number-3">4.1.</span> <code>COUT</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
Quite possibly, one of the simplest keywords. Outputs something to the screen without a newline.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Outputs text to <code>stdout</code>.</td>
<td class="org-left">Accepts any amount of string arguments as the text to output.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>COUT ?? "Hello, World!";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org10bd267" class="outline-3">
<h3 id="org10bd267"><span class="section-number-3">4.2.</span> <code>ENDL</code> and <code>ENDL2</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
These ones are also extremely simple: all they do is output new lines to the screen. <code>ENDL</code> outputs 1 newline, while <code>ENDL2</code> outputs 2.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Outputs newlines to <code>stdout</code> (1 if <code>ENDL</code>, 2 if <code>ENDL2</code>).</td>
<td class="org-left">Does not accept or need any arguments.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>ENDL; ENDL2;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
