documentation/cxsetup/cxsetup_1.0.org
** =STYLE=, =FORE= and =BACK=
These 3 keywords all serve the same general purpose: styling text. To better understand them, they've been split into 3 tables, one for each.

| =STYLE=                                                          | Arguments                                                                                                                                            | Returns | Exceptions                          | Example            |
|----------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------+---------+-------------------------------------+--------------------|
| Applies a style to ~stdout~ (lasts until =STYLE ?? "RESET_ALL";=). | Accepts one string argument representing the style to apply (must be one of: ~DIM~, ~RESET~, ~RESET_ALL~, ~BRIGHT~, ~NORMAL~). ~RESET~ is the same as ~RESET_ALL~. | None    | ~ValueError~ - invalid style argument | =STYLE ?? "BRIGHT";= |

| =FORE=                                                                                          | Arguments                                                                                                                                                                                                                                                          | Returns | Exceptions                                     | Example           |
|-----------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+------------------------------------------------+-------------------|
| Applies a foreground color to ~stdout~ (lasts until =STYLE ?? "RESET_ALL";= or =FORE ?? "RESET";=). | Accepts one string argument representing the color to apply (must be one of: ~RESET~, ~BLACK~, ~BLUE~, ~GREEN~, ~YELLOW~, ~MAGENTA~, ~RED~, ~CYAN~, ~WHITE~, ~LIGHTBLACK_EX~, ~LIGHTBLUE_EX~, ~LIGHTGREEN_EX~, ~LIGHTYELLOW_EX~, ~LIGHTMAGENTA_EX~, ~LIGHTRED_EX~, ~LIGHTCYAN_EX~, ~LIGHTWHITE_EX~). | None    | ~ValueError~ - invalid foreground color argument | =FORE ?? "YELLOW";= |

| =BACK=                                                                                          | Arguments                                                                                                                                                                                                                                                          | Returns | Exceptions                                     | Example                 |
|-----------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+------------------------------------------------+-------------------------|
| Applies a background color to ~stdout~ (lasts until =STYLE ?? "RESET_ALL";= or =BACK ?? "RESET";=). | Accepts one string argument representing the color to apply (must be one of: ~RESET~, ~BLACK~, ~BLUE~, ~GREEN~, ~YELLOW~, ~MAGENTA~, ~RED~, ~CYAN~, ~WHITE~, ~LIGHTBLACK_EX~, ~LIGHTBLUE_EX~, ~LIGHTGREEN_EX~, ~LIGHTYELLOW_EX~, ~LIGHTMAGENTA_EX~, ~LIGHTRED_EX~, ~LIGHTCYAN_EX~, ~LIGHTWHITE_EX~). | None    | ~ValueError~ - invalid background color argument | =BACK ?? "LIGHTBLUE_EX";= |

** =TERMINATE=
This is the keyword responsible for terminating the script safely instead of waiting for the end of the file.

| Summary                                                  | Arguments                                  | Returns | Exceptions                             | Example                         |
|----------------------------------------------------------+--------------------------------------------+---------+----------------------------------------+---------------------------------|
| Terminates the execution of the current CX Setup script. | ~ExitCode~ - optional integer, defaults to 0 | None    | ~TypeError~ - ~ExitCode~ is not an integer | =TERMINATE ?? 4; // error code 4= |

** =CIN= (0 arguments overload)
This is the overload of =CIN= that requires no arguments.

=CIN= is the most basic tool for getting input from the user (more specifically, ~stdin~).

| Summary                            | Arguments                                                                                                                                            | Returns         | Exceptions | Example                                   |
|------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------+-----------------+------------+-------------------------------------------|
| Reads input from the user (~stdin~). | This is the 0 arguments overload. For the other overloads, look up ~CIN (x arguments overload)~ in the *Table of Contents*, where ~x~ is either 0, 1 or 2. | The user input. | None       | =CIN; // this will get input from the user= |

** =CIN= (1 argument overload)
This is the overload of =CIN= that requires 1 argument.

Sometimes, you might need to set a character limit on a user's input. That way, even if they type more than that, only the first ~x~ characters actually get cached.

#+begin_center
If the character limit is set to *0 or a negative number*, it will be ignored and it'll be the same as calling =CIN= with no arguments at all.
#+end_center

| Summary                                                              | Arguments                                         | Returns                                                             | Exceptions | Example                                                                 |
|----------------------------------------------------------------------+---------------------------------------------------+---------------------------------------------------------------------+------------+-------------------------------------------------------------------------|
| Reads input from the user (~stdin~), while applying a character limit. | ~CharLimit~ - integer, the character limit to apply | The user input, with the character limit applied if greater than 0. | None       | =CIN ?? 4; // this will cache the first 4 characters of the user's input= |

