documentation/cxsetup/cxsetup_1.0.html
<div id="outline-container-orga9bafa2" class="outline-3">
<h3 id="orga9bafa2"><span class="section-number-3">4.3.</span> <code>STYLE</code>, <code>FORE</code> and <code>BACK</code></h3>
<div class="outline-text-3" id="text-4-3">
<p>
These 3 keywords all serve the same general purpose: styling text. To better understand them, they&rsquo;ve been split into 3 tables, one for each.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>STYLE</code></th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Applies a style to <code>stdout</code> (lasts until <code>STYLE ?? "RESET_ALL";</code>).</td>
<td class="org-left">Accepts one string argument representing the style to apply (must be one of: <code>DIM</code>, <code>RESET</code>, <code>RESET_ALL</code>, <code>BRIGHT</code>, <code>NORMAL</code>). <code>RESET</code> is the same as <code>RESET_ALL</code>.</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid style argument</td>
<td class="org-left"><code>STYLE ?? "BRIGHT";</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>FORE</code></th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Applies a foreground color to <code>stdout</code> (lasts until <code>STYLE ?? "RESET_ALL";</code> or <code>FORE ?? "RESET";</code>).</td>
<td class="org-left">Accepts one string argument representing the color to apply (must be one of: <code>RESET</code>, <code>BLACK</code>, <code>BLUE</code>, <code>GREEN</code>, <code>YELLOW</code>, <code>MAGENTA</code>, <code>RED</code>, <code>CYAN</code>, <code>WHITE</code>, <code>LIGHTBLACK_EX</code>, <code>LIGHTBLUE_EX</code>, <code>LIGHTGREEN_EX</code>, <code>LIGHTYELLOW_EX</code>, <code>LIGHTMAGENTA_EX</code>, <code>LIGHTRED_EX</code>, <code>LIGHTCYAN_EX</code>, <code>LIGHTWHITE_EX</code>).</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid foreground color argument</td>
<td class="org-left"><code>FORE ?? "YELLOW";</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>BACK</code></th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Applies a background color to <code>stdout</code> (lasts until <code>STYLE ?? "RESET_ALL";</code> or <code>BACK ?? "RESET";</code>).</td>
<td class="org-left">Accepts one string argument representing the color to apply (must be one of: <code>RESET</code>, <code>BLACK</code>, <code>BLUE</code>, <code>GREEN</code>, <code>YELLOW</code>, <code>MAGENTA</code>, <code>RED</code>, <code>CYAN</code>, <code>WHITE</code>, <code>LIGHTBLACK_EX</code>, <code>LIGHTBLUE_EX</code>, <code>LIGHTGREEN_EX</code>, <code>LIGHTYELLOW_EX</code>, <code>LIGHTMAGENTA_EX</code>, <code>LIGHTRED_EX</code>, <code>LIGHTCYAN_EX</code>, <code>LIGHTWHITE_EX</code>).</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid background color argument</td>
<td class="org-left"><code>BACK ?? "LIGHTBLUE_EX";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2f0709f" class="outline-3">
<h3 id="org2f0709f"><span class="section-number-3">4.4.</span> <code>TERMINATE</code></h3>
<div class="outline-text-3" id="text-4-4">
<p>
This is the keyword responsible for terminating the script safely instead of waiting for the end of the file.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Terminates the execution of the current CX Setup script.</td>
<td class="org-left"><code>ExitCode</code> - optional integer, defaults to 0</td>
<td class="org-left">None</td>
<td class="org-left"><code>TypeError</code> - <code>ExitCode</code> is not an integer</td>
<td class="org-left"><code>TERMINATE ?? 4; // error code 4</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3c4e4c4" class="outline-3">
<h3 id="org3c4e4c4"><span class="section-number-3">4.5.</span> <code>CIN</code> (0 arguments overload)</h3>
<div class="outline-text-3" id="text-4-5">
<p>
This is the overload of <code>CIN</code> that requires no arguments.
</p>

<p>
<code>CIN</code> is the most basic tool for getting input from the user (more specifically, <code>stdin</code>).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>).</td>
<td class="org-left">This is the 0 arguments overload. For the other overloads, look up <code>CIN (x arguments overload)</code> in the <b>Table of Contents</b>, where <code>x</code> is either 0, 1 or 2.</td>
<td class="org-left">The user input.</td>
<td class="org-left">None</td>
<td class="org-left"><code>CIN; // this will get input from the user</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org74254f0" class="outline-3">
<h3 id="org74254f0"><span class="section-number-3">4.6.</span> <code>CIN</code> (1 argument overload)</h3>
<div class="outline-text-3" id="text-4-6">
<p>
This is the overload of <code>CIN</code> that requires 1 argument.
</p>

<p>
Sometimes, you might need to set a character limit on a user&rsquo;s input. That way, even if they type more than that, only the first <code>x</code> characters actually get cached.
</p>

<div class="org-center">
<p>
If the character limit is set to <b>0 or a negative number</b>, it will be ignored and it&rsquo;ll be the same as calling <code>CIN</code> with no arguments at all.
</p>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>), while applying a character limit.</td>
<td class="org-left"><code>CharLimit</code> - integer, the character limit to apply</td>
<td class="org-left">The user input, with the character limit applied if greater than 0.</td>
<td class="org-left">None</td>
<td class="org-left"><code>CIN ?? 4; // this will cache the first 4 characters of the user's input</code></td>
</tr>
</tbody>
</table>
</div>
</div>
