documentation/cxsetup/cxsetup_1.0.org
** =RUN=
Given CXSetup is used in ContenterX's setup scripts, it's kind of an obligation for it to allow the creator of the script to *run subprocesses* programatically.

| Summary                                   | Arguments                                                                                                                                                                    | Returns | Exceptions                                                                     | Example                                                                    |
|-------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+--------------------------------------------------------------------------------+----------------------------------------------------------------------------|
| Runs a command with arguments (optional). | At least 1 argument must be given. The first argument is the *command/process* and the others are the arguments. Split the process's arguments across different =RUN= arguments. | None    | ~InternalError~ - split process arguments across different arguments (see below) | =RUN ?? "sudo" ?? "apt" ?? "install" ?? "emacs"; // this will install Emacs. If you're root, that is :)= |

*** The Number 1 cause of error when using =RUN=
The following statements are all incorrect:
#+begin_src
RUN ?? "sudo apt install emacs";
RUN ?? "sudo" ?? "apt install emacs";
RUN ?? "sudo apt" ?? "install emacs";
RUN ?? "sudo" ?? "apt" ?? "install emacs";
RUN ?? "sudo" ?? "apt install" ?? "emacs";
RUN ?? "sudo apt install" ? "emacs";
#+end_src

The reason for it is that arguments for the process must be splitted across arguments for =RUN=.

The correct way to do this installation would be:
#+begin_src
RUN ?? "sudo" ?? "apt" ?? "install" ?? "emacs";
#+end_src

** =CIN= (2 arguments overload)
This is the overload of =CIN= that requires 2 arguments.

Other than setting a character limit, this overload also allows you to set a custom prompt message for the input.

The only disadvantage is that applying a character limit becomes mandatory. However, you can get past that due to how the character limit works.

#+begin_center
If the character limit is *0 or a negative number*, no limit will be applied.
#+end_center

| Summary                                                                                                                | Arguments                                                                     | Returns                                                             | Exceptions | Example                                   |
|------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------+---------------------------------------------------------------------+------------+-------------------------------------------|
| Reads input from the user (~stdin~), while applying a character limit (if applicable) and using a custom prompt message. | ~CharLimit~ - integer; ~PromptMessage~ - string, the custom prompt message to use | The user input, with the character limit applied if greater than 0. | None       | =CIN ?? 4 ?? "Only 4 characters please: ";= |

** =GETPASS=
Sometimes, you may need to be more discreet with your inputs. For example, it's not really a great idea to get *passwords* with =CIN=, since it shows what is being typed.

=GETPASS= solves such issue. With this keyword, you can safely get passwords without showing them on screen. This keyword's only limitation is, unironically, the fact it cannot be limited to a certain number of characters (any amount is accepted).

| Summary                                                                                                                   | Arguments                                                          | Returns         | Exceptions | Example                                      |
|---------------------------------------------------------------------------------------------------------------------------+--------------------------------------------------------------------+-----------------+------------+----------------------------------------------|
| Reads input from the user (~stdin~) with ~echo~ disabled, meaning it does not show on screen what is being typed by the user. | ~PromptMessage~ - mandatory string, the custom prompt message to use | The user input. | None       | =GETPASS ?? "Insert your password, please: ";= |

