documentation/cxsetup/cxsetup_1.0.html
<div id="outline-container-orga57db79" class="outline-3">
<h3 id="orga57db79"><span class="section-number-3">4.10.</span> <code>SAFECIN</code> (1 argument overload)</h3>
<div class="outline-text-3" id="text-4-10">
<p>
<code>CIN</code> has yet another big issue: when it is given a character limit, it makes sure the input doesn&rsquo;t go beyond the limit. However, it does <b>not</b> make sure the input has the specified length.
</p>

<p>
This might not seem problematic, but it becomes when <b>cache grabs</b> are involved. Cache grabs will be a matter of discussing later, due to their complexity. However, here is a small representation of the issue.
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; CIN ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"Your input please: "</span>;
Your input please: Good
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
Good
</pre>
</div>

<p>
No issue at first. Well let&rsquo;s move on to the second example.
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; CIN ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"Input: "</span>;
Input: Ok
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
Ok
&gt;&gt;&gt; CIN ?? <span style="color: #ffd400; font-weight: bold;">1</span> ?? <span style="color: #7984D1;">"Input: "</span>;
Input: A
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
OkA
</pre>
</div>

<p>
Now, imagine the first input was done to ask for the path of a very important file. But, before the file is used, another input is done.
</p>

<p>
Now, CXSetup would think the file is named <code>OkA</code>, when it is actually named <code>Ok</code>.
</p>

<p>
To avoid this issue, we can safely use <code>SAFECIN</code>. To make sure the input is as long as we want it to be, <code>SAFECIN</code> pads the right of the input with spaces (if necessary) until the length of the input matches.
</p>

<p>
Then, when doing the cache grab, we can trim the spaces if necessary.
</p>

<p>
Here&rsquo;s our example, but <i>refined</i>. To better illustrate it, the meaningful whitespaces have been represented as <code>[SPACE]</code>.
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; SAFECIN ?? <span style="color: #ffd400; font-weight: bold;">4</span>;
An input is required (press Enter to ignore it): Ok
&gt;&gt;&gt; CIN;
An input is required (press Enter to ignore it): A
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
Ok[SPACE][SPACE]
&gt;&gt; COUT ?? c0:4l:1:3:b; // the little b means trim both sides - we<span style="color: #7984D1;">'ll talk about it soon</span>
<span style="color: #7984D1;">Ok</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>), making sure its length matches the character limit we apply.</td>
<td class="org-left"><code>CharLimit</code> - integer, length of the input</td>
<td class="org-left">The user input, with length matching the <code>CharLimit</code>.</td>
<td class="org-left">None</td>
<td class="org-left"><code>SAFECIN ?? 4;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew (MF366)</p>
<p class="date">Created: 2025-04-14 seg 19:46</p>
</div>
</body>
</html>
